//**************************************************
// インクルードファイル（include）
//**************************************************
#include "main.h"
#include "typedefine.h"		// 型定義
#include <stdio.h>

#include "hal/hal_spi.h"

//**************************************************
// 定義（define）
//**************************************************

//**************************************************
// 列挙体（enum）
//**************************************************

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************

//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************

// *************************************************************************
//   機能		： SPI通信の初期化
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2020.3.4			TKR				新規
// *************************************************************************/
PUBLIC SPI_init( void ){
	//LL_SPI_Enable(SPI1);		// エンコーダ用
	LL_SPI_Enable(SPI2);		// ジャイロ用

}


// *************************************************************************
//   機能		： SPI通信の送受信
//   注意		： なし
//   メモ		： なし
//   引数		： SPI番号，送信データバッファ，受信データバッファ，CSのポート，CSの番号
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2020.3.4			TKR				新規
// *************************************************************************/
PUBLIC SPI_Communication(SPI_TypeDef *SPIx, CHAR *tx_data, CHAR *rx_data, CHAR length, GPIO_TypeDef *GPIOx, uint32_t CS_PIN){

	CHAR	count	= length;

	LL_GPIO_ResetOutputPin(GPIOx, CS_PIN);		// CSをLowにする

	if( LL_SPI_IsActiveFlag_RXNE(SPIx) == SET )LL_SPI_ReceiveData8(SPIx);
	if( LL_SPI_IsEnabled(SPIx) == RESET )LL_SPI_Enable(SPIx);

	while( count > 0 ){
		LL_SPI_TransmitData8(SPIx, *tx_data++);
		while( LL_SPI_IsActiveFlag_TXE(SPIx) == 0 );
		while( LL_SPI_IsActiveFlag_RXNE(SPIx) == 0 );
		*rx_data++	= LL_SPI_ReceiveData8(SPIx);
		count--;
	}

	LL_GPIO_SetOutputPin(GPIOx, CS_Pin);		// CSをHighにする

}
