//**************************************************
// インクルードファイル（include）
//**************************************************
#include "main.h"
#include "typedefine.h"
#include <stdio.h>

#include "app/mode.h"
#include "hal/hal_led.h"


//**************************************************
// 定義（define）
//**************************************************

//**************************************************
// 列挙体（enum）
//**************************************************

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************

//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************

// *************************************************************************
//   機能		： LEDを全部ONする。
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2020.1.2			TKR				新規
// *************************************************************************/
PUBLIC void LED_onAll( void ){

	LL_GPIO_SetOutputPin(LED0_GPIO_Port, LED0_Pin);
	LL_GPIO_SetOutputPin(LED1_GPIO_Port, LED1_Pin);
	LL_GPIO_SetOutputPin(LED2_GPIO_Port, LED2_Pin);
	LL_GPIO_SetOutputPin(LED3_GPIO_Port, LED3_Pin);

}

// *************************************************************************
//   機能		： 前面のLEDを全部OFFする。
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2020.1.1			TKR				新規
// *************************************************************************/
PUBLIC void LED_offAll( void ){

	LL_GPIO_ResetOutputPin(LED0_GPIO_Port, LED0_Pin);
	LL_GPIO_ResetOutputPin(LED1_GPIO_Port, LED1_Pin);
	LL_GPIO_ResetOutputPin(LED2_GPIO_Port, LED2_Pin);
	LL_GPIO_ResetOutputPin(LED3_GPIO_Port, LED3_Pin);

}

// *************************************************************************
//   機能		： 複数のLEDを点灯させる
//   注意		： なし
//   メモ		：
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2020.1.2			TKR				新規
// *************************************************************************/
PUBLIC void LED_on_multi( CHAR c_num ){

	//printf("%d\n\r",c_num);

	// ビット演算をして順次点灯させていく
	if( (c_num & 0x80) == 0x80 ){
		LL_GPIO_SetOutputPin(LED0_GPIO_Port, LED0_Pin);
	}

	if( (c_num & 0x40) == 0x40 ){
		LL_GPIO_SetOutputPin(LED1_GPIO_Port, LED1_Pin);
	}

	if( (c_num & 0x20) == 0x20 ){
		LL_GPIO_SetOutputPin(LED2_GPIO_Port, LED2_Pin);
	}

	if( (c_num & 0x10) == 0x10 ){
		LL_GPIO_SetOutputPin(LED3_GPIO_Port, LED3_Pin);
	}

}
