#ifndef INC_MODE_H_
#define INC_MODE_H_

//**************************************************
// インクルードファイル（include）
//**************************************************
#include "main.h"
#include "typedefine.h"


//**************************************************
// 定義（define）
//**************************************************
#define		SW_ON		(OFF)
#define		SW_OFF		(ON)

#define		SW_CHATTERING_WAIT	(200)		// SWのチャタリング対策

//**************************************************
// 列挙体（enum）
//**************************************************
typedef enum{
	MODE_0 = 0,
	MODE_1,
	MODE_2,
	MODE_3,
	MODE_4,
	MODE_5,
	MODE_6,
	MODE_7,
	MODE_8,
	MODE_9,
	MODE_10,
	MODE_11,
	MODE_12,
	MODE_13,
	MODE_14,
	MODE_15,
	MODE_MAX
}enMODE;

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************

//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************
PUBLIC void MODE_inc(void);
PUBLIC void MODE_exe( void );

#endif /* INC_MODE_H_ */
